# IFailuresPreprocessor Methods

---
The IFailuresPreprocessor type exposes the following members.
| Name| Description
---|---|---
| PreprocessFailures|  This method is called when there have been failures found at the end of a transaction and Revit is about to start processing them.
Top
#### Reference
IFailuresPreprocessor Interface
Autodesk.Revit.DB Namespace